LEMOSinflowGeneratorMod/testCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

libs            ( "libZY_LEMOSinflowMod.so" );

application     reactingFoam;

startFrom       startTime;

startTime       0;

stopAt          writeNow;

endTime         0.62;

deltaT          1e-08;

writeControl    adjustableRunTime;

writeInterval   0.04;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  on;

maxCo           0.5;

maxDeltaT       5e-06;


// ************************************************************************* //
