LEMOSinflowGeneratorMod/testCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inner
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       30348;
    }
    outer
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       30356;
    }
    coflow
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       30364;
    }
    bluffBody
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          28;
        startFace       30372;
    }
    airBC
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       30400;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          52;
        startFace       32000;
    }
)

// ************************************************************************* //
