LEMOSinflowGeneratorMod/testCase/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}

chemistryType
{
    chemistrySolver ode;
    chemistryThermo psi;
    method          standard;//standard;
}

chemistry       off;

initialChemicalTimeStep 1e-07;

odeCoeffs
{
    solver          seulex;
    absTol          1e-12;
    relTol          0.01;
}

CCM
{
    ratioOxygenToCarbonElementInFuel 0;
    min:max:SpanZoneJe 0 20 0.01;
    min:max:SpanZoneT 300 3000 5;
    min:max:SpanZoneXi 0 1 0.01;
    chemistryLoadBalancing on;
    pressureMapping off;
    chemicallyFrozenT chemicallyFrozenT [ 0 0 0 1 0 ] 300;
    maxFlammabilityLimit maxFlammabilityLimit [ 0 0 0 0 0 ] 20;
    expChi          on;
    elementalChi    on;
}


CCMspecies      ;
CH4             0 1 0.001;
N2              0 1 0.001;
// ************************************************************************* //
